
var channel1 = Array();
var channel2 = Array();
channel1[0] = [[1, "文化"], [2, "体育"], [3, "娱乐"], [4, "美食"], [5, "股票"], [6, "IT"], [7, "军事"], [8, "杂谈"], [9, "游戏"], [10, "教育"], [11, "育儿"], [12, "旅游"], [13, "房产"], [14, "汽车"], [15, "星座"], [16, "时尚"], [17, "家居"], [18, "健康"], [19, "休闲"], [20, "情感"], [21, "校园"], [22, "财经"]];

channel2[1] = [[68, "人文历史"], [69, "原创文学"], [70, "书籍评论"], [71, "文化评论"]];
channel2[2] = [[48, "国内游"], [49, "国外游"], [50, "主题游"], [51, "人在旅途"], [52, "其他旅行"], [72, "篮球风云"], [73, "天下足球"], [74, "综合体育"]];
channel2[3] = [[53, "美味食谱"], [54, "烘焙甜品"], [55, "美酒饮品"], [56, "天下吃货"], [57, "其他美食"], [75, "明星日志"], [76, "八卦爆料"], [77, "影音评论"], [78, "粉丝心情"]];
channel2[4] = [[79, "美食推介"], [80, "餐厅品鉴"], [81, "食谱大全"]];
channel2[5] = [[82, "行情汇报"], [83, "走势分析"], [84, "股票心得"]];
channel2[6] = [[33, "服饰搭配"], [34, "鞋包配饰"], [35, "奢侈品"], [36, "美容美发"], [37, "美体瘦身"], [38, "购物社区"], [39, "其他时尚"], [85, "数码科技"], [86, "IT评论"], [87, "科技动态"]];
channel2[7] = [[88, "军事热点"], [89, "军情揭秘"], [90, "军史回顾"], [91, "军事装备"]];
channel2[8] = [[92, "随笔感悟"], [93, "生活记录"], [94, "综合评论"]];
channel2[9] = [[95, "游戏新闻"], [96, "评论杂谈"], [97, "游戏介绍"], [98, "游戏cosplay"], [99, "攻略心得"]];
channel2[10] = [[58, "电影"], [59, "热播剧"], [60, "视频"], [61, "游戏"], [62, "啪啪·唱吧"], [63, "音乐"], [64, "其他娱乐"], [100, "教育时评"], [101, "考试资料"], [102, "教育交流"]];
channel2[11] = [[103, "亲子孕育"], [104, "怀孕生子"], [105, "婴幼教育"], [106, "温馨家庭"]];
channel2[12] = [[107, "旅游景点"], [108, "路线推介"], [109, "交通住宿"], [110, "游记散文"]];
channel2[13] = [[111, "地产行情"], [112, "房屋推介"], [113, "租住日记"]];
channel2[14] = [[65, "动漫名作"], [66, "动漫风格"], [67, "动漫达人"], [114, "行业评论"], [115, "业界动态"], [116, "汽车产品"], [117, "精彩旅程"]];
channel2[15] = [[29, "笑话百科"], [30, "各种萌"], [31, "调侃趣多多"], [32, "其他搞笑"], [118, "星座命运"], [119, "预测生肖"], [120, "占卜测试"]];
channel2[16] = [[121, "美丽潮流"], [122, "流行服饰"], [123, "时尚杂志"]];
channel2[17] = [[124, "家装设计"], [125, "家居生活"], [126, "装修点滴"]];
channel2[18] = [[127, "健康资讯"], [128, "寻医问药"], [129, "保健养生"], [130, "心理卫生"], [131, "美容瘦身"]];
channel2[19] = [[132, "私人生活"], [133, "休闲方式"], [134, "减压放松"], [135, "家中宠物"]];
channel2[20] = [[136, "情感故事"], [137, "青春随想"], [138, "血缘亲情"], [139, "同志爱人"]];
channel2[21] = [[140, "校园生活"], [141, "青春梦想"], [142, "留学就业"]];
channel2[22] = [[143, "证券理财"], [144, "理财技巧"], [145, "产经发展"], [146, "经济管理"]];

function SetOptions(obj, datas) {
    var options = "";
    options = "<option id='a' value='-1'>请选择</option>";
    for (var i = 0; i < datas.length; i++) {
        options += "<option id='" + datas[i][0] + "' value='" + datas[i][0] + "'>" + datas[i][1] + "</option>";
    }
    $(obj).html(options);
}

function InitChannel1() {
    SetOptions("#channel1", channel1[0]);
}

$(document).ready(function () {
    
});

function changechannel() {
    var id = $("#channel1").val();
    SetOptions("#channel2", channel2[id]);
}

function SetOptionSelected(obj, value) {
    if (value && value > 0) {
        $(obj).val(value);
    }
    
}

function SetChannelSelected(channel1, channel2) {
    if (channel1 && channel1 > 0) {
        SetOptionSelected("#channel1", channel1);
        changechannel();
        SetOptionSelected("#channel2", channel2);
    }
   
}